// ------------------------------------ //
// ------------- Problem 1 ------------ //
// ------------------------------------ //
// У вас є масив об’єктів fruts, і в кожному з них є name
// Напишіть код, який перетворює їх в масив імен.

// const fruits = [
//   { id: 0, name: 'Apple' },
//   { id: 1, name: 'Tomat' },
//   { id: 2, name: 'Cherry' },
//   { id: 3, name: 'Orange' },
// ];

// let names = fruits.map(item => item.name);
// console.log(names);

// ------------------------------------ //
// ------------- Problem 2 ------------ //
// ------------------------------------ //
// Виведіть парні числа від 2 до 10, використовуючи цикл for.

// for (let i = 1; i < 11; i++) {
//   if (i % 2 === 0) console.log(i);
// }

// ------------------------------------ //
// ------------- Problem 3 ------------ //
// ------------------------------------ //
// Замініть цикл "for" на "while"
// for (let i = 0; i < 5; i++) {
//   console.log(`цифра ${i}!`);
// }

// let i = 0;

// while (i < 5) {
//   console.log(`цифра ${i}!`);
//   i++;
// }

// ------------------------------------ //
// ------------- Problem 4 ------------ //
// ------------------------------------ //
// Напишіть цикл, який пропонує prompt ввести число більше за 100.
// Якщо відвідувач введе менше число – попросити ввести ще раз, і так далі.
// Цикл повинен запитувати число доти, доки відвідувач не введе число,
// більше за 100, або не скасує ввід/введе порожній рядок.

// while (true) {
//   let number = prompt('Enter a number greater than 100');
//   if (!number) break;
//   else if (Number(number) > 100) {
//     console.log(number);
//     break;
//   }
// }

// ------------------------------------ //
// ------------- Problem 5 ------------ //
// ------------------------------------ //
// Вирахуйте середній вік

// const girls = [
//   { age: 23, name: 'Оля' },
//   { age: 29, name: 'Аня' },
//   { age: 10, name: 'Юля' },
//   { age: 20, name: 'Катя' },
// ];

// let ageArr = girls.map(item => item.age);
// // console.log(ageArr);

// let avarageAge = ageArr.reduce((accum, item) => accum + item) / ageArr.length;
// console.log('The average age of the girls is ', avarageAge);
